In [7]:
import pandas as pd
df = pd.read_csv("C:/Users/user/Desktop/국영수.csv", encoding = "cp949")
df = df.drop(["체육"], axis=1)
df

   국어  영어  수학
0  50  88  21
1  41  87  54
2  85  65  84
3  61  85  13
4  54  41  21
5  84  47  87
6  77  98  65
7  87  58  54
8  54  22  78

In [19]:
data = {
    'A':[1,2,3,4],
    'B':[4.1,3.5,2.1,5.7],
    'C':['one','two','three','four']
}

data = pd.DataFrame(data)

In [20]:
data

   A    B      C
0  1  4.1    one
1  2  3.5    two
2  3  2.1  three
3  4  5.7   four

In [21]:
data['A'] = data['A'].astype(float)

In [22]:
data

     A    B      C
0  1.0  4.1    one
1  2.0  3.5    two
2  3.0  2.1  three
3  4.0  5.7   four

In [23]:
data['A'] = data['A'].astype(int)

In [24]:
data

   A    B      C
0  1  4.1    one
1  2  3.5    two
2  3  2.1  three
3  4  5.7   four

In [40]:
data['A'] = data['A'].astype('str')

In [41]:
data

   A    B      C
0  1  4.1    one
1  2  3.5    two
2  3  2.1  three
3  4  5.7   four

In [42]:
data.dtypes # A 변수가 object로 변경!

A     object
B    float64
C     object
dtype: object

In [43]:
data['A'] = data['A'].astype(int)

In [44]:
data

   A    B      C
0  1  4.1    one
1  2  3.5    two
2  3  2.1  three
3  4  5.7   four

In [45]:
data['C'] = data['C'].astype(int) # 문자형태는 숫자형태로 변환하는 것은 불가능하다

ValueError: invalid literal for int() with base 10: 'one'

In [48]:
df = df.rename(columns={'영어':'english'}) # 칼럼 이름 바꾸기 csv에서 바꾸면 까먹을 수 있고 매번 바꿔줘야해서 하나의 프로세스로 만들어라

In [49]:
df

     국어  english  수학
0  50.0       88  21
1  41.0       87  54
2  85.0       65  84
3  61.0       85  13
4  54.0       41  21
5  84.0       47  87
6  77.0       98  65
7  87.0       58  54
8  54.0       22  78

In [51]:
df = pd.read_csv("C:/Users/user/Desktop/국영수2.csv", encoding = "cp949")

In [52]:
df

     국어  영어    수학 체육
0  50.0  88  21.0  상
1  41.0  87  54.0  중
2  85.0  65  84.0  상
3  61.0  85  13.0  중
4  54.0  41  21.0  하
5  84.0  47  87.0  하
6  77.0  98  65.0  상
7  87.0  58   NaN  중
8   NaN  22  78.0  하

In [56]:
df.fillna(df.median()) # 중앙값으로 대체
# 전체 변수를 처리해주는 것이기 때문에 오류가 난다
# 체육만 제외하고 다른 데이터만 작업한다

TypeError: Cannot convert [['상' '중' '상' '중' '하' '하' '상' '중' '하']] to numeric

In [54]:
df

     국어  영어    수학 체육
0  50.0  88  21.0  상
1  41.0  87  54.0  중
2  85.0  65  84.0  상
3  61.0  85  13.0  중
4  54.0  41  21.0  하
5  84.0  47  87.0  하
6  77.0  98  65.0  상
7  87.0  58   NaN  중
8   NaN  22  78.0  하

In [57]:
A=df.select_dtypes(include=["number"]).columns

In [60]:
print(df[A]) # 수치형 데이터를 가진 칼럼만 나온다

     국어  영어    수학
0  50.0  88  21.0
1  41.0  87  54.0
2  85.0  65  84.0
3  61.0  85  13.0
4  54.0  41  21.0
5  84.0  47  87.0
6  77.0  98  65.0
7  87.0  58   NaN
8   NaN  22  78.0

In [66]:
B=df.select_dtypes(include=['object','category']).columns # 문자와 카테고리 변수를 가진 칼럼만

In [67]:
print(df[B])

  체육
0  상
1  중
2  상
3  중
4  하
5  하
6  상
7  중
8  하

In [69]:
df[A] = df[A].fillna(df[A].median())

In [70]:
df[A]

     국어  영어    수학
0  50.0  88  21.0
1  41.0  87  54.0
2  85.0  65  84.0
3  61.0  85  13.0
4  54.0  41  21.0
5  84.0  47  87.0
6  77.0  98  65.0
7  87.0  58  59.5
8  69.0  22  78.0

In [74]:
pd.concat([df[A], df[B]], axis=0) # 행기준

     국어    영어    수학   체육
0  50.0  88.0  21.0  NaN
1  41.0  87.0  54.0  NaN
2  85.0  65.0  84.0  NaN
3  61.0  85.0  13.0  NaN
4  54.0  41.0  21.0  NaN
5  84.0  47.0  87.0  NaN
6  77.0  98.0  65.0  NaN
7  87.0  58.0  59.5  NaN
8  69.0  22.0  78.0  NaN
0   NaN   NaN   NaN    상
1   NaN   NaN   NaN    중
2   NaN   NaN   NaN    상
3   NaN   NaN   NaN    중
4   NaN   NaN   NaN    하
5   NaN   NaN   NaN    하
6   NaN   NaN   NaN    상
7   NaN   NaN   NaN    중
8   NaN   NaN   NaN    하

In [76]:
df = pd.concat([df[A], df[B]], axis=1) # 열기준

In [78]:
df # 결측지 제거 완료!

     국어  영어    수학 체육
0  50.0  88  21.0  상
1  41.0  87  54.0  중
2  85.0  65  84.0  상
3  61.0  85  13.0  중
4  54.0  41  21.0  하
5  84.0  47  87.0  하
6  77.0  98  65.0  상
7  87.0  58  59.5  중
8  69.0  22  78.0  하

In [80]:
import numpy as np

data = {
    'Numeric1':[1,np.nan,3,4],
    'Numeric2':[5, 6,np.nan,8.2],
    'Category':['dog',np.nan,'cat','dog']
}

df = pd.DataFrame(data)
df

   Numeric1  Numeric2 Category
0       1.0       5.0      dog
1       NaN       6.0      NaN
2       3.0       NaN      cat
3       4.0       8.2      dog

In [81]:
df[(df['Numeric2']>=6)&(df['Numeric2']<=10)]

   Numeric1  Numeric2 Category
1       NaN       6.0      NaN
3       4.0       8.2      dog

In [82]:
df[(df['Numeric2']>=6)|(df['Numeric2']<=10)]

   Numeric1  Numeric2 Category
0       1.0       5.0      dog
1       NaN       6.0      NaN
3       4.0       8.2      dog

In [84]:
df[df['Numeric2']>5]

TypeError: '>' not supported between instances of 'str' and 'int'

In [86]:
data = {
    '나이':[22,35,14,55,42]
}

df = pd.DataFrame(data)
df

   나이
0  22
1  35
2  14
3  55
4  42

In [87]:
def categorize (data):
    if 0 < data <= 10:
        return "10대"
    elif 10 < data <= 20:
        return "20대"
    elif 20 < data <= 30:
        return "30대"
    else:
        return "30대 이상"

df['검사나이'] = df['나이'].apply(categorize)

In [88]:
df

   나이    검사나이
0  22     30대
1  35  30대 이상
2  14     20대
3  55  30대 이상
4  42  30대 이상

In [89]:
# 문자형 데이터 처리
# 상 중 하 

data = {
    'Numeric1':[1,np.nan,3,4],
    'Numeric2':[5, 6,np.nan,8.2],
    'Category':['dog',np.nan,'cat','dog']
}

df = pd.DataFrame(data)
df

   Numeric1  Numeric2 Category
0       1.0       5.0      dog
1       NaN       6.0      NaN
2       3.0       NaN      cat
3       4.0       8.2      dog

In [90]:
filter_df = df[df['Category']=='dog']

In [91]:
filter_df

   Numeric1  Numeric2 Category
0       1.0       5.0      dog
3       4.0       8.2      dog

In [93]:
filter_df_contains = df[df['Category'].str.contains('do', na=False)]

In [94]:
filter_df_contains

   Numeric1  Numeric2 Category
0       1.0       5.0      dog
3       4.0       8.2      dog

In [95]:
df = pd.DataFrame({
    'variable':['value1-value2-value3', "value3-value1-value5", "vvdfvalue165656"]
})

In [96]:
df

               variable
0  value1-value2-value3
1  value3-value1-value5
2       vvdfvalue165656

In [97]:
df["new_variable"]=df['variable'].str.replace(r'value1.*','value1',regex=True)

In [98]:
print(df["new_variable"])

0           value1
1    value3-value1
2       vvdfvalue1
Name: new_variable, dtype: object

In [100]:
df["new_variable"]=df['variable'].str.extract(r'(value1)')
print(df["new_variable"]) 
# 모두 value1이란 문자열이 포함되어 있어 value1로 된다

0    value1
1    value1
2    value1
Name: new_variable, dtype: object

In [101]:
df["new_variable"]=df['variable'].str.extract(r'(value2)')
print(df["new_variable"])

0    value2
1       NaN
2       NaN
Name: new_variable, dtype: object

In [108]:
# 1번째 방법
df = pd.DataFrame({
    'variable': ['value1-value2-value3', 'value4-value5', 'value6']
})

split_df = df['variable'].str.split('-', expand=True)
# -를 기준으로 나누고 각각 데이터프레임을 생성한는 옵션
split_df

        0       1       2
0  value1  value2  value3
1  value4  value5    None
2  value6    None    None

In [106]:
# 2번째 방법
df = pd.DataFrame({
    'variable': ['value1-value2-value3', 'value4-value5', 'value6']
})

df['variable']=df['variable'].str[0:5]
df['variable']

0    value
1    value
2    value
Name: variable, dtype: object

In [107]:
df['variable']=df['variable'].str[0:5] + df['variable'].str[6:12]
df['variable']

0    value
1    value
2    value
Name: variable, dtype: object

In [110]:
split_df['var1']=split_df['var1'].astype(str)
split_df['var2']=split_df['var2'].astype(str)
split_df['var3']=split_df['var3'].astype(str)

split_df['combined'] = split_df['var1']+ '-' + split_df['var2'] + '-' + split_df['var3']

KeyError: 'var1'